Revit 2027 API
LightingSource Enumeration
 Indicates the lighting scheme type in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LightingSource
Public Enumeration LightingSource
public enum class LightingSource
type LightingSource
Members
Member name | Value | Description
ExteriorArtificial | 23 |  Exterior source of light, artificial light only.
ExteriorSun | 21 |  Exterior source of light, sun only.
ExteriorSunAndArtificial | 22 |  Exterior source of light, sun and artificial light.
InteriorArtificial | 26 |  Interior source of light, artificial light only.
InteriorSun | 24 |  Interior source of light, sun only.
InteriorSunAndArtificial | 25 |  Interior source of light, sun and artificial light.
See Also
Reference
Autodesk.Revit.DB Namespace